{
  "backend/main.mo": "Defines auction actor with players, bidders, audience limits, and logic for joining/leaving audience and starting auctions.",
  "backend/migration.mo": "Provides a migration initializing audience-related fields for the backend canister.",
  "feature_evidence.json": "Lists feature evidence linking audience-limit features to corresponding frontend files and tests.",
  "frontend-file-summaries.txt": "High-level summaries of all major frontend files including new audience-limit features.",
  "frontend/index.css": "Base Tailwind setup defining custom OKLCH color variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point loading the React application.",
  "frontend/src/App.tsx": "Main app router switching between setup, auction, results, and audience screens.",
  "frontend/src/components/auction/AuctionScreen.tsx": "UI for running the auction with bidding, selling players, and viewing current state.",
  "frontend/src/components/auction/AudienceScreen.tsx": "Read‑only live auction viewer that auto‑joins/leaves audience and shows capacity and auction data.",
  "frontend/src/components/auction/guards.ts": "Implements validation for setup fields and bid submissions, enforcing required formats and constraints.",
  "frontend/src/components/auction/ResultsScreen.tsx": "Displays final auction results, including bidder rosters, spending summaries, and error/loading states.",
  "frontend/src/components/auction/SetupScreen.tsx": "Provides a form to configure bidders, players, and secret key, then triggers auction initialization.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header navigation, content area, and footer.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useAuctionQueries.ts": "Provides React Query hooks for fetching auction state and performing actions like starting auctions, bidding, and audience management.",
  "frontend/src/hooks/useInternetIdentity.ts": "Handles Internet Identity auth flow, storing identity state and exposing login and logout utilities.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light/dark theme OKLCH color variables and global base styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/utils/backendErrors.ts": "Provides functions to normalize and clean backend error messages into readable user-facing strings.",
  "frontend/src/utils/format.ts": "Contains formatting helpers for rupee amounts, player status, and highest bidder text.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH color tokens, animations, fonts, and plugins.",
  "project_state.json": "Stores project metadata, implemented features, pending requests, and overall project state."
}