{
  "backend/main.mo": "Motoko canister implementing two-bidder auction logic including state management, bidding, selling players, and auction rounds with a secret key.",
  "feature_evidence.json": "Metadata describing a feature update requiring rupee-based currency formatting across several frontend files with high confidence.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files detailing their responsibilities in the auction app.",
  "frontend/index.css": "Base Tailwind styles defining OKLCH color variables for light/dark themes and applying global background/foreground settings.",
  "frontend/index.html": "HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root component controlling navigation between setup, auction, results, and audience screens while storing the secret key.",
  "frontend/src/components/auction/AuctionScreen.tsx": "Main auction interface handling bid placement, player selection, auction state display, and secret key–gated actions.",
  "frontend/src/components/auction/AudienceScreen.tsx": "Read‑only live auction view that polls for updates and displays current player, highest bid, bidders, and player status tables.",
  "frontend/src/components/auction/guards.ts": "Provides validation helpers for auction setup and bidding, ensuring required fields, uniqueness, and budget rules.",
  "frontend/src/components/auction/ResultsScreen.tsx": "Displays auction results, showing each bidder's roster, spending, and sales history, with loading and error states.",
  "frontend/src/components/auction/SetupScreen.tsx": "Renders the auction setup form allowing entry of bidder names, player names, and a secret key, with validation and initialization logic.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header navigation, footer, and screen switching for setup, auction, audience, and results views.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, invalidating related queries when identity changes.",
  "frontend/src/hooks/useAuctionQueries.ts": "Defines React Query hooks for fetching auction state and performing auction actions such as initialization, bidding, starting, and selling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context and hooks for login, logout, identity persistence, and status tracking.",
  "frontend/src/index.css": "Defines Tailwind layers and theme CSS variables for light and dark modes using a sports-themed color palette.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/utils/backendErrors.ts": "Provides utilities to normalize and clean backend error messages into readable text.",
  "frontend/src/utils/format.ts": "Defines rupee formatting, player status evaluation, and highest-bidder display helpers.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors based on CSS variables, fonts, animations, and plugins.",
  "project_state.json": "Stores project metadata, feature requests, and current state for rupee-based auction updates."
}