{
  "kind": "build_request",
  "title": "Add live audience (spectator) view for watching the auction in real time",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-10",
      "text": "Add an Audience (spectator) screen that lets viewers watch the auction live in a read-only mode, showing the current auctioned player, current highest bid and highest bidder, bidder remaining budgets, and the sold/unsold players list.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "Add one more details that audience can also see the auction live"
        ]
      },
      "acceptanceCriteria": [
        "A new Audience screen exists and is reachable from the app navigation (e.g., a new 'Audience' tab).",
        "The Audience screen renders the current player being auctioned (or a clear message when no round is active).",
        "The Audience screen renders the current highest bid and highest bidder (or 'No bids yet' when appropriate).",
        "The Audience screen renders bidder names and remaining budgets.",
        "The Audience screen renders a players table/list with sold vs unsold status, sold price, and bought-by information.",
        "The Audience screen does not render any controls that mutate state (no start auction, place bid, finalize sale actions).",
        "All user-facing text on the Audience screen is in English."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Make the Audience (spectator) screen update automatically to reflect the live auction state by polling the existing backend auction state query on an interval.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "Add one more details that audience can also see the auction live"
        ]
      },
      "acceptanceCriteria": [
        "When the auction host performs actions (start auction, place bid, finalize sale) in another session/browser, the Audience screen updates automatically without a manual refresh.",
        "Polling uses React Query (e.g., a query with a refetch interval) and does not introduce any WebSocket or real-time infrastructure.",
        "Loading and error states are handled cleanly (e.g., spinner while loading; error alert if state cannot be fetched)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files listed in SYSTEM_CONTEXT.frontend.immutablePaths.",
    "Keep all backend logic in the single Motoko actor (backend/main.mo); do not introduce additional backend services."
  ],
  "nonGoals": [
    "Do not implement live chat.",
    "Do not implement an auction host/admin role or permissions.",
    "Do not add WebSocket-based real-time updates; polling is sufficient for 'live' viewing."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}