{
  "kind": "build_request",
  "title": "Add audience live call participant limit of 13",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement an audience participant limit of 13 concurrent audience members for the Audience screen, enforced by the backend so it cannot be bypassed from the frontend.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Also add audience live call limit only of 13"
        ]
      },
      "acceptanceCriteria": [
        "When a 14th unique audience principal attempts to join, the backend rejects the request with a clear error message indicating the audience limit (13) has been reached.",
        "The limit is enforced server-side (Motoko), not only via UI checks.",
        "Re-joining from the same principal does not consume an additional slot (idempotent join)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add backend APIs to support audience presence tracking: a method to join the audience, a method to leave the audience, and a query method to fetch current audience count (and/or list) needed by the UI.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Also add audience live call limit only of 13"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes callable methods for join and leave and a query for current audience size.",
        "Audience state resets appropriately when a new auction is started (so stale audience members from a prior auction do not keep occupying slots)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the Audience screen UI to attempt to join on mount and leave on unmount (best-effort), and show an English user-facing error state when the audience limit is reached (e.g., 'Audience limit reached (13). Please try again later.').",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Also add audience live call limit only of 13"
        ]
      },
      "acceptanceCriteria": [
        "Opening the Audience screen triggers a join call; navigating away triggers a leave call.",
        "If join fails due to the limit, the Audience screen shows a clear error message and does not continue polling/visualizing live auction data as if joined successfully.",
        "If join succeeds, the Audience screen continues to function normally (polling every ~2 seconds as it does today)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Expose the current audience count in the Audience screen (and/or header area) using the new backend query so viewers can see how many audience members are currently connected out of 13.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Also add audience live call limit only of 13"
        ]
      },
      "acceptanceCriteria": [
        "The Audience screen displays a count formatted like 'Audience: X/13' (English).",
        "The displayed count updates periodically (can reuse the existing polling cadence)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Implementing real-time communication (WebSockets) or actual live audio/video calling.",
    "Adding third-party authentication beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}