{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Audience live call capacity UI integration (13 max)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Integrate backend-enforced audience capacity (max 13) into the Audience screen flow so the UI respects backend rejection and handles idempotent joins.",
      "acceptanceCriteria": [
        "When a 14th unique audience principal attempts to join, the backend rejects the request with a clear error message indicating the audience limit (13) has been reached.",
        "The limit is enforced server-side (Motoko), not only via UI checks.",
        "Re-joining from the same principal does not consume an additional slot (idempotent join)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAuctionQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks/mutations that call existing backend capabilities related to audience presence (join/leave) and capacity checks, normalizing failures via the existing backend error utilities. This will be used by the Audience screen to react to backend-enforced capacity and idempotent join semantics."
        },
        {
          "path": "frontend/src/components/auction/AudienceScreen.tsx",
          "operation": "modify",
          "description": "Update AudienceScreen to perform a join attempt before starting live auction polling/rendering, and to transition into a dedicated error state when the backend denies entry due to capacity. Use existing shadcn/ui components already imported (e.g., Alert, Badge, Card) to present the error and status. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Attempt to join the audience on Audience screen mount, leave on unmount (best-effort), and show a clear English error when the limit is reached; prevent live polling when not joined.",
      "acceptanceCriteria": [
        "Opening the Audience screen triggers a join call; navigating away triggers a leave call.",
        "If join fails due to the limit, the Audience screen shows a clear error message and does not continue polling/visualizing live auction data as if joined successfully.",
        "If join succeeds, the Audience screen continues to function normally (polling every ~2 seconds as it does today)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auction/AudienceScreen.tsx",
          "operation": "modify",
          "description": "Implement mount/unmount lifecycle behavior: on mount, call the new join-audience mutation and only enable auction state polling after successful join; on unmount, trigger a best-effort leave call (do not block navigation). If join is rejected due to capacity, display an English message like \"Audience limit reached (13). Please try again later.\" and keep polling disabled. Use existing shadcn/ui Alert for error presentation. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/backendErrors.ts",
          "operation": "modify",
          "description": "Ensure normalized backend errors remain readable for audience-join failures (including capacity-reached messages) so the Audience screen can display a clear English user-facing error state."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Display and periodically refresh the current audience count as 'Audience: X/13' on the Audience screen using the backend capacity query.",
      "acceptanceCriteria": [
        "The Audience screen displays a count formatted like 'Audience: X/13' (English).",
        "The displayed count updates periodically (can reuse the existing polling cadence)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAuctionQueries.ts",
          "operation": "modify",
          "description": "Add a query hook that fetches current audience capacity info (e.g., current count/max capacity/message) using the backend capability designed for this, and support periodic refetching aligned with the Audience screen polling cadence."
        },
        {
          "path": "frontend/src/components/auction/AudienceScreen.tsx",
          "operation": "modify",
          "description": "Render an 'Audience: X/13' indicator (e.g., near the Live Auction View header area) sourced from the new audience-capacity query, and refetch it periodically (can align with the existing 2-second cadence). Keep the indicator consistent with the joined/error state (e.g., still show count if available, but do not start auction polling unless joined). Use existing shadcn/ui primitives already in the file where appropriate. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}